Revit 2022 API
InCanvasControlData Constructor (String, XYZ)
 Constructs an InCanvasControlData with specific values assigned.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
Since: 2022
Syntax
C#
public InCanvasControlData(
	string imagePath,
	XYZ position
)
Visual Basic
Public Sub New ( _
	imagePath As String, _
	position As XYZ _
)
Visual C++
public:
InCanvasControlData(
	String^ imagePath,
	XYZ^ position
)
Parameters
imagePath
Type: System.String
 File path with the image to be used. This must be an absolute path to a location on disk.
position
Type: Autodesk.Revit.DB.XYZ
 The position to be used.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  The file format specified by imagePath is an unsupported format - only *.bmp files are supported.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
Autodesk.Revit.Exceptions.FileArgumentNotFoundException |  The file specified by imagePath doesn't exist.
See Also
InCanvasControlData Class
InCanvasControlData Overload
Autodesk.Revit.DB Namespace